powerfull/src/DataProcessors/РасчетСебестоимостиТоваров/РасчетСебестоимостиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетСебестоимостиТоваров</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

powerfull/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

powerfull/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>InformationRegister.ИсторияПоставочныхЦен</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоставкаТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.ПродажаТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроданныеТовары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/DataProcessors/РасчетСебестоимостиТоваров/ObjectModule.bsl
Процедура РассчитатьСебестоимость() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ПоступлениеТоваров.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	                |ГДЕ
	                |	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И ПоступлениеТоваров.Проведен";
	 
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		  СформироватьДвиженияПоступление(Выборка.Ссылка);
		
	КонецЦикла;
	  
	  
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	РеализацияТоваров.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.РеализацияТоваров КАК РеализацияТоваров
	                |ГДЕ
	                |	РеализацияТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваров.Проведен
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	РеализацияТоваров.Дата";
	 
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		  НачатьТранзакцию();
		  
		  Попытка
			  СформироватьДвижениеРеализация(Выборка.Ссылка);
			  ЗафиксироватьТранзакцию();
		  Исключение
			  ОтменитьТранзакцию();
			  ВызватьИсключение;
		  КонецПопытки;
		
	КонецЦикла;
	  
КонецПроцедуры

Процедура СформироватьДвиженияПоступление(Ссылка)
	
	 ДокОбъект = Ссылка.ПолучитьОбъект();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ПоступлениеТоваровПоставкаТоваров.Товар КАК Товар,
	                |	ПоступлениеТоваровПоставкаТоваров.Количество КАК Количество,
	                |	ПоступлениеТоваровПоставкаТоваров.Сумма КАК Сумма
	                |ИЗ
	                |	Документ.ПоступлениеТоваров.ПоставкаТоваров КАК ПоступлениеТоваровПоставкаТоваров
	                |ГДЕ
	                |	ПоступлениеТоваровПоставкаТоваров.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	
	 ДокОбъект.Движения.СебестоимостьТоваров.Записывать = Истина;
	 
	 Пока Выборка.Следующий() Цикл
	 
		 Движение = ДокОбъект.Движения.СебестоимостьТоваров.ДобавитьПриход();
		 Движение.Период = ДокОбъект.Дата;
		 Движение.Товар = Выборка.Товар;
		 Движение.Количество = Выборка.Количество;
		 Движение.Сумма = Выборка.Сумма;
		 
	КонецЦикла;
	 
	 ДокОбъект.Движения.Записать();	 
	 
 КонецПроцедуры
 
Процедура СформироватьДвижениеРеализация(Ссылка)
	 
	 ДокОбъект = Ссылка.ПолучитьОбъект();
	 
	 Движения = ДокОбъект.Движения;
	 
	 Движения.СебестоимостьТоваров.Записывать = Истина; 
	 Движения.Записать();
	 
	 Блокировка = Новый БлокировкаДанных;
	 
	 ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СебестоимостьТоваров");
	 ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	 ЭлементБлокировки.ИсточникДанных = ДокОбъект.ПроданныеТовары;
	 ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	 
	 Блокировка.Заблокировать();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	РеализацияТоваровПроданныеТовары.Товар КАК Товар,
	                |	СУММА(РеализацияТоваровПроданныеТовары.Количество) КАК Количество,
	                |	СУММА(РеализацияТоваровПроданныеТовары.Сумма) КАК Сумма
	                |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	                |ИЗ
	                |	Документ.РеализацияТоваров.ПроданныеТовары КАК РеализацияТоваровПроданныеТовары
	                |ГДЕ
	                |	РеализацияТоваровПроданныеТовары.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровПроданныеТовары.Товар
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_ДанныеДокумента.Товар КАК Товар,
	                |	ВТ_ДанныеДокумента.Количество КАК Количество,
	                |	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	                |	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
	                |	СебестоимостьТоваровОстатки.СуммаОстаток КАК СуммаОстаток
	                |ИЗ
	                |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(
	                |				&Период,
	                |				Товар В
	                |					(ВЫБРАТЬ
	                |						ВТ_ДанныеДокумента.Товар КАК Товар
	                |					ИЗ
	                |						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК СебестоимостьТоваровОстатки
	                |		ПО ВТ_ДанныеДокумента.Товар = СебестоимостьТоваровОстатки.Товар";
					
					
					
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("Период", ДокОбъект.МоментВремени());
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Движения.СебестоимостьТоваров.Записывать = Истина;
	 
	 Пока Выборка.Следующий() Цикл
		 
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			ШаблонОшибки = "Недостаточно товаров %1, для проведения документа %2";
			ВызватьИсключение СтрШаблон(ШаблонОшибки, Выборка.Товар, Ссылка);
		КонецЕсли;
		
		Если  Выборка.Количество = Выборка.КоличествоОстаток Тогда
			 Себестоимость = Выборка.СуммаОстаток;
		Иначе
			 Себестоимость = Выборка.СуммаОстаток * Выборка.Количество / Выборка.КоличествоОстаток;
		КонецЕсли;
		
		 Движение = Движения.СебестоимостьТоваров.ДобавитьРасход();
		 Движение.Период = ДокОбъект.Дата;
		 Движение.Товар = Выборка.Товар;
		 Движение.Количество = Выборка.Количество;
		 Движение.Сумма = Себестоимость;
		 		 
	 КонецЦикла;
	 
         Движения.Записать();
		 
КонецПроцедуры
